#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <ctype.h>
#include <stdlib.h>
#include <time.h>
#include "custom_functions.h"

#define MAX_CREDENTIALS 100 // Maximum number of credentials

////////////////////////
// Structs//
////////////////////////

struct login{
    char patientID [10];
    char password [10];
    char Name[50];
};

struct date{
    int day;
    int month;
    int year;
};

struct time{
    int hours;
    int minutes;
};

struct ehr{
    char patientID[10];
    char patientName[50];
    struct date dob;
    char medicalHistory[500];
    char allergies[200];
    char medications[200];
    char pastProcedures[300];
    char diagnostics[300];
};

struct doctorSchedule{
    char doctorID[10];
    struct date apdate;
    struct time starttime;
    struct time endtime;
};

struct appointment{
    char appointmentID[20];
    char patientID[10];
    char patientName[50];
    char doctorID[10];
    char doctorName[50];
    char reason[50];
    char status[10];
    struct date apdate;
    struct time starttime;
    struct time endtime;
    char cancel[50];
	int cancel_ref;
};

struct treatments{
    char patientID[7];
    char patientName[50];
    struct date treatmentdate;
    char condition[100];
    char treatment[100];
    char outcome[100];
};

// Define a structure to hold username and password for any role
typedef struct {
    char username[50];
    char password[50];
    char role[20];
} Credentials;

// Define the structure for Appointment
typedef struct {
    char Date[11];
    char Time[6];
    char PatientName[50];
    char Doctor[50];
    char AppointmentType[50];
    char Status[20];
} Appointment;

struct doctor{
    char doctorID[10];
    char doctorName[50];
};

struct insurance_claim {
    char claimID[10];
    char patientID[10];
    char appointmentID[10];
    char billingID[10];
    char insuranceCompany[50];
    char insuranceNumber[20];
    char claimStatus[20];
    double claimAmount;
    struct date claimDate;
    struct date approvalDate;
    struct time claimTime;
    struct time approvalTime;
};

struct billing {
    char billingID[10];
    char patientID[10];
    char appointmentID[20];
    double total;
    double insuranceCoveredAmount;
    double patientResponsibleAmount;
    double insurancepaid;
    char paymentmethod[11];
    double amountgiven;
    double change;
    double tax;
    char insuranceProvider[50];
    char insuranceID[20];
    char claimID[20];
    char status[8]; //14
    struct date insurancebillingdate;   //17
    struct time insurancebillingtime;   //19
    struct date insurancepaymentdate;   //22
    struct time insurancepaymenttime;   //24
    struct date billingdate;            //27
    struct time billingtime;            //29
    struct date paymentdate;            //32
    struct time paymenttime;            //34
};

struct inv {
    char itemName [50];
    int itemQuantity;
};

//////////////////////////
///Doctor Functions
///Ahmed Jinan Ali
///TP075798
/////////////////////////

//Validation functions

// Function to check if the input time is valid
int isValidTime(struct time t) {
    // Basic validation example (adjust as per your requirements)
    if (t.hours < 0 || t.hours > 23)
        return 0;
    if (t.minutes < 0 || t.minutes > 59)
        return 0;
    return 1;
}

// Function to get the current date and time
void get_current_datetime(struct date* current_date, struct time* current_time) {
    time_t t = time(NULL);
    struct tm tm = *localtime(&t);

    current_date->day = tm.tm_mday;
    current_date->month = tm.tm_mon + 1;
    current_date->year = tm.tm_year + 1900;

    current_time->hours = tm.tm_hour;
    current_time->minutes = tm.tm_min;
}

// Function to check if the input time is valid
